const {Router} = require('express')
const router = Router()

function shuffle(arr){
	var j, temp;
	for(var i = arr.length - 1; i > 0; i--){
		j = Math.floor(Math.random()*(i + 1));
		temp = arr[j];
		arr[j] = arr[i];
		arr[i] = temp;
	}
	return arr;
}

router.get('/getarr',(req,res)=>{
    const array = [
        {
            name: 'qled-120-b',
            rating:3,
            type:'fridge',
            typeRu:'Холодильник',
            sort:'fell',
            sortRu:'смешанные',
            company:'Lg',
            value: '50000',
            url: '792375925298.jpg',
            description:'Очень удобный холодильник прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла',
            har: [
                ['Вольтаж',220,'вольт'],
                ['Ширина',120,'см'],
                ['Высота',220,'см'],
                ['Длинна',100,'см'],
                ['Наличие морозилки',true],
            ]
        },
        {
            name: 'gled-130-a',
            rating:4,
            type:'fridge',
            typeRu:'Холодильник',
            sort:'fell',
            sortRu:'смешанные',
            company:'Samsung',
            value: '60000',
            url: '206470f449eddcf51bb23cd166f4ff5f.jpg',
            description:'Очень удобный холодильник прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла',
            har: [
                ['Вольтаж',230,'вольт'],
                ['Ширина',130,'см'],
                ['Высота',230,'см'],
                ['Длинна',110,'см'],
                ['Наличие морозилки',false],
            ]
        },
        //холлодильники смешанные
        {
            name: 'gled-130-a argo',
            rating:4,
            type:'fridge',
            typeRu:'Холодильник',
            sort:'freeze',
            sortRu:'морозильники',
            company:'Honor',
            value: '20000',
            url: 'g6ud5cz4j2junm6og4kmnnc85b2gb9sy.jpg',
            description:'Очень удобная морозильная камера прекрасно подходящая для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла',
            har: [
                ['Вольтаж',230,'вольт'],
                ['Ширина',130,'см'],
                ['Высота',130,'см'],
                ['Длинна',110,'см'],
            ]
        },
        {
            name: 'gled-130-b uurus',
            rating:4,
            type:'fridge',
            typeRu:'Холодильник',
            sort:'freeze',
            sortRu:'морозильники',
            company:'Lenovo',
            value: '20000',
            url: '6e2a21a00931ab53a86312bd7c421d22.jpg',
            description:'Очень удобная морозильная камера прекрасно подходящая для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла',
            har: [
                ['Вольтаж',220,'вольт'],
                ['Ширина',120,'см'],
                ['Высота',150,'см'],
                ['Длинна',100,'см'],
            ]
        },
        //холодильники морозилки
        {
            name: 's-145 fn200',
            rating:4,
            type:'microwave',
            sort:'convection',
            sortRu:'с конвекцией',
            typeRu:'Микроволновка',
            company:'Leto',
            value: '30000',
            url: 'samsung_mc32k7055ct_7.jpg',
            description:'Очень удобная микроволновка прекрасно подходящая для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла',
            har: [
                ['Вольтаж',420,'вольт'],
                ['Ширина',80,'см'],
                ['Высота',60,'см'],
                ['Длинна',55,'см'],
            ]
        },
        {
            name: 'n-328 fl300',
            rating:5,
            type:'microwave',
            sort:'convection',
            sortRu:'с конвекцией',
            typeRu:'Микроволновка',
            company:'Leto',
            value: '20000',
            url: '50938_main_.jpg',
            description:'Очень удобная микроволновка прекрасно подходящая для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла',
            har: [
                ['Вольтаж',430,'вольт'],
                ['Ширина',70,'см'],
                ['Высота',50,'см'],
                ['Длинна',50,'см'],
            ]
        },
        //микроволновки с конвекцией
        {
            name: 'plage 520 neo stick',
            rating:2,
            type:'microwave',
            sort:'grille',
            sortRu:'с грилем',
            typeRu:'Микроволновка',
            company:'Samsung',
            value: '50000',
            url: '20037161b2.jpg',
            description:'Очень удобная микроволновка прекрасно подходящая для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла',
            har: [
                ['Вольтаж',410,'вольт'],
                ['Ширина',70,'см'],
                ['Высота',50,'см'],
                ['Длинна',50,'см'],
            ]
        },
        {
            name: 'plage 300 neo',
            rating:4,
            type:'microwave',
            sort:'grille',
            sortRu:'с грилем',
            typeRu:'Микроволновка',
            company:'Samsung',
            value: '35000',
            url: '$_57.JPG',
            description:'Очень удобная микроволновка прекрасно подходящая для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла',
            har: [
                ['Вольтаж',410,'вольт'],
                ['Ширина',20,'см'],
                ['Высота',20,'см'],
                ['Длинна',50,'см'],
            ]
        },
        // микроволновки с грилем
        {
            rating:5,
            name: 'r720-643-b',
            type:'teapot',
            sort:'home',
            sortRu:'домашние',
            typeRu:'Чайник',
            company:'helo',
            value: '3000',
            url: '100025322203b0.jpg',
            description:'Очень удобный чайник прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла',
            har: [
                ['Вольтаж',320,'вольт'],
                ['Ширина',20,'см'],
                ['Высота',40,'см'],
                ['Длинна',20,'см'],
                ['Обьем',20,'литр'],
            ]
        },
        {
            rating:3,
            name: 'guader 430-5x',
            type:'teapot',
            sort:'home',
            sortRu:'домашние',
            typeRu:'Чайник',
            company:'Samsung',
            value: '2000',
            url: 'gelberk-elektricheskij-chajnik-gl-32_zolotistyj-2575901.jpg',
            description:'Очень удобный чайник прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла',
            har: [
                ['Вольтаж',220,'вольт'],
                ['Ширина',30,'см'],
                ['Высота',60,'см'],
                ['Длинна',30,'см'],
                ['Обьем',30,'литр'],
            ]
        },
        //чайники домашние
        {
            rating:3,
            name: 'descueni el 5',
            type:'teapot',
            sort:'turrist',
            sortRu:'походные',
            typeRu:'Чайник',
            company:'Lenovo',
            value: '500',
            url: '1208_chaynik-pokhodnyy-alyuminievy.jpg',
            description:'Очень удобный чайник прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла',
            har: [
                ['Вольтаж',120,'вольт'],
                ['Ширина',30,'см'],
                ['Высота',60,'см'],
                ['Длинна',30,'см'],
                ['Обьем',30,'литр'],
                ['Встроенный аккумулятор',false],
            ]
        },
        {
            rating:4,
            name: 'guader 420-3b',
            type:'teapot',
            sort:'turrist',
            sortRu:'походные',
            typeRu:'Чайник',
            company:'Samsung',
            value: '1000',
            url: 'compress_700-nw.jpg',
            description:'Очень удобный чайник прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла',
            har: [
                ['Вольтаж',120,'вольт'],
                ['Ширина',30,'см'],
                ['Высота',60,'см'],
                ['Длинна',30,'см'],
                ['Обьем',30,'литр'],
                ['Встроенный аккумулятор',false],
            ]
        },
        //чайники походные
        {
            rating:5,
            name: 'bibi 3',
            type:'vacuum',
            sort:'robot',
            sortRu:'роботы',
            typeRu:'пылесос',
            company:'Samsung',
            value: '70000',
            url: 'icleboo56-1000x1000.jpg',
            description:'Очень удобный робот пылесос прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла',
            har: [
                ['Вольтаж',220,'вольт'],
                ['Ширина',30,'см'],
                ['Высота',10,'см'],
                ['Длинна',30,'см'],
            ]
        },
        {
            rating:4,
            name: 'bibi 1',
            type:'vacuum',
            sort:'robot',
            sortRu:'роботы',
            typeRu:'пылесос',
            company:'Samsung',
            value: '40000',
            url: '53268325fjfdj-.jpg',
            description:'Очень удобный робот пылесос прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла',
            har: [
                ['Вольтаж',320,'вольт'],
                ['Ширина',40,'см'],
                ['Высота',10,'см'],
                ['Длинна',40,'см'],
            ]
        },
        // пылесосы роботы
        {
            rating:4,
            name: 'luminate x80',
            type:'vacuum',
            sort:'arm',
            sortRu:'ручные',
            typeRu:'пылесос',
            company:'Lg',
            value: '10000',
            url: 'pylesos_supra_vcs_2024_731611_1.jpg',
            description:'Очень удобный пылесос прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла',
            har: [
                ['Вольтаж',320,'вольт'],
                ['Ширина',40,'см'],
                ['Высота',40,'см'],
                ['Длинна',40,'см'],
                ['Длинна шланга',120,'см'],
            ]
        },
        {
            rating:3,
            name: 'bosh vacuum 32',
            type:'vacuum',
            sort:'arm',
            sortRu:'ручные',
            typeRu:'пылесос',
            company:'Lg',
            value: '7000',
            url: '95b05cc08fb96c9066cfc853828cfbcd.jpg',
            description:'Очень удобный пылесос прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла',
            har: [
                ['Вольтаж',320,'вольт'],
                ['Ширина',40,'см'],
                ['Высота',40,'см'],
                ['Длинна',60,'см'],
                ['Длинна шланга',100,'см'],
            ]
        },
        // пылесосы ручные
        {
            rating:5,
            name: 'disaster mk5',
            type:'dishwasher',
            sort:'full',
            sortRu:'полноразмерные',
            typeRu:'посудомоечные машины',
            company:'Lg',
            value: '120000',
            url: 'smeg_ud503ds_4.jpg',
            description:'Очень удобная посудомоечная машинка прекрасно подходящая для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла',
            har: [
                ['Вольтаж',420,'вольт'],
                ['Ширина',100,'см'],
                ['Высота',150,'см'],
                ['Длинна',100,'см'],
            ]
        },
        {
            rating:4,
            name: 'killer gun',
            type:'conditioneer',
            sort:'investor',
            sortRu:'инвесторные',
            typeRu:'кондиционер',
            company:'Xiaomi',
            value: '20000',
            url: '2194556-1024x1024.jpg',
            description:'Очень удобный кондиционер прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла',
            har: [
                ['Вольтаж',220,'вольт'],
                ['Ширина',100,'см'],
                ['Высота',20,'см'],
                ['Длинна',20,'см'],
            ]
        }, 
    ]
    const arr = [{"rating":4,"name":"killer gun","type":"conditioneer","sort":"investor","sortRu":"инвесторные","typeRu":"кондиционер","company":"Xiaomi","value":"20000","url":"2194556-1024x1024.jpg","description":"Очень удобный кондиционер прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла","har":[["Вольтаж",220,"вольт"],["Ширина",100,"см"],["Высота",20,"см"],["Длинна",20,"см"]]},{"name":"n-328 fl300","rating":5,"type":"microwave","sort":"convection","sortRu":"с конвекцией","typeRu":"Микроволновка","company":"Leto","value":"20000","url":"50938_main_.jpg","description":"Очень удобная микроволновка прекрасно подходящая для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла","har":[["Вольтаж",430,"вольт"],["Ширина",70,"см"],["Высота",50,"см"],["Длинна",50,"см"]]},{"rating":5,"name":"r720-643-b","type":"teapot","sort":"home","sortRu":"домашние","typeRu":"Чайник","company":"helo","value":"3000","url":"100025322203b0.jpg","description":"Очень удобный чайник прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла","har":[["Вольтаж",320,"вольт"],["Ширина",20,"см"],["Высота",40,"см"],["Длинна",20,"см"],["Обьем",20,"литр"]]},{"name":"plage 300 neo","rating":4,"type":"microwave","sort":"grille","sortRu":"с грилем","typeRu":"Микроволновка","company":"Samsung","value":"35000","url":"$_57.JPG","description":"Очень удобная микроволновка прекрасно подходящая для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла","har":[["Вольтаж",410,"вольт"],["Ширина",20,"см"],["Высота",20,"см"],["Длинна",50,"см"]]},{"rating":4,"name":"guader 420-3b","type":"teapot","sort":"turrist","sortRu":"походные","typeRu":"Чайник","company":"Samsung","value":"1000","url":"compress_700-nw.jpg","description":"Очень удобный чайник прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла","har":[["Вольтаж",120,"вольт"],["Ширина",30,"см"],["Высота",60,"см"],["Длинна",30,"см"],["Обьем",30,"литр"],["Встроенный аккумулятор",false]]},{"name":"qled-120-b","rating":3,"type":"fridge","typeRu":"Холодильник","sort":"fell","sortRu":"смешанные","company":"Lg","value":"50000","url":"792375925298.jpg","description":"Очень удобный холодильник прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла","har":[["Вольтаж",220,"вольт"],["Ширина",120,"см"],["Высота",220,"см"],["Длинна",100,"см"],["Наличие морозилки",true]]},{"name":"gled-130-a","rating":4,"type":"fridge","typeRu":"Холодильник","sort":"fell","sortRu":"смешанные","company":"Samsung","value":"60000","url":"206470f449eddcf51bb23cd166f4ff5f.jpg","description":"Очень удобный холодильник прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла","har":[["Вольтаж",230,"вольт"],["Ширина",130,"см"],["Высота",230,"см"],["Длинна",110,"см"],["Наличие морозилки",false]]},{"rating":3,"name":"bosh vacuum 32","type":"vacuum","sort":"arm","sortRu":"ручные","typeRu":"пылесос","company":"Lg","value":"7000","url":"95b05cc08fb96c9066cfc853828cfbcd.jpg","description":"Очень удобный пылесос прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла","har":[["Вольтаж",320,"вольт"],["Ширина",40,"см"],["Высота",40,"см"],["Длинна",60,"см"],["Длинна шланга",100,"см"]]},{"name":"gled-130-a argo","rating":4,"type":"fridge","typeRu":"Холодильник","sort":"freeze","sortRu":"морозильники","company":"Honor","value":"20000","url":"g6ud5cz4j2junm6og4kmnnc85b2gb9sy.jpg","description":"Очень удобная морозильная камера прекрасно подходящая для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла","har":[["Вольтаж",230,"вольт"],["Ширина",130,"см"],["Высота",130,"см"],["Длинна",110,"см"]]},{"rating":3,"name":"guader 430-5x","type":"teapot","sort":"home","sortRu":"домашние","typeRu":"Чайник","company":"Samsung","value":"2000","url":"gelberk-elektricheskij-chajnik-gl-32_zolotistyj-2575901.jpg","description":"Очень удобный чайник прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла","har":[["Вольтаж",220,"вольт"],["Ширина",30,"см"],["Высота",60,"см"],["Длинна",30,"см"],["Обьем",30,"литр"]]},{"rating":4,"name":"bibi 1","type":"vacuum","sort":"robot","sortRu":"роботы","typeRu":"пылесос","company":"Samsung","value":"40000","url":"53268325fjfdj-.jpg","description":"Очень удобный робот пылесос прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла","har":[["Вольтаж",320,"вольт"],["Ширина",40,"см"],["Высота",10,"см"],["Длинна",40,"см"]]},{"rating":5,"name":"bibi 3","type":"vacuum","sort":"robot","sortRu":"роботы","typeRu":"пылесос","company":"Samsung","value":"70000","url":"icleboo56-1000x1000.jpg","description":"Очень удобный робот пылесос прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла","har":[["Вольтаж",220,"вольт"],["Ширина",30,"см"],["Высота",10,"см"],["Длинна",30,"см"]]},{"rating":5,"name":"disaster mk5","type":"dishwasher","sort":"full","sortRu":"полноразмерные","typeRu":"посудомоечные машины","company":"Lg","value":"120000","url":"smeg_ud503ds_4.jpg","description":"Очень удобная посудомоечная машинка прекрасно подходящая для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла","har":[["Вольтаж",420,"вольт"],["Ширина",100,"см"],["Высота",150,"см"],["Длинна",100,"см"]]},{"name":"gled-130-b uurus","rating":4,"type":"fridge","typeRu":"Холодильник","sort":"freeze","sortRu":"морозильники","company":"Lenovo","value":"20000","url":"6e2a21a00931ab53a86312bd7c421d22.jpg","description":"Очень удобная морозильная камера прекрасно подходящая для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла","har":[["Вольтаж",220,"вольт"],["Ширина",120,"см"],["Высота",150,"см"],["Длинна",100,"см"]]},{"name":"plage 520 neo stick","rating":2,"type":"microwave","sort":"grille","sortRu":"с грилем","typeRu":"Микроволновка","company":"Samsung","value":"50000","url":"20037161b2.jpg","description":"Очень удобная микроволновка прекрасно подходящая для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла","har":[["Вольтаж",410,"вольт"],["Ширина",70,"см"],["Высота",50,"см"],["Длинна",50,"см"]]},{"rating":4,"name":"luminate x80","type":"vacuum","sort":"arm","sortRu":"ручные","typeRu":"пылесос","company":"Lg","value":"10000","url":"pylesos_supra_vcs_2024_731611_1.jpg","description":"Очень удобный пылесос прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла","har":[["Вольтаж",320,"вольт"],["Ширина",40,"см"],["Высота",40,"см"],["Длинна",40,"см"],["Длинна шланга",120,"см"]]},{"name":"s-145 fn200","rating":4,"type":"microwave","sort":"convection","sortRu":"с конвекцией","typeRu":"Микроволновка","company":"Leto","value":"30000","url":"samsung_mc32k7055ct_7.jpg","description":"Очень удобная микроволновка прекрасно подходящая для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла","har":[["Вольтаж",420,"вольт"],["Ширина",80,"см"],["Высота",60,"см"],["Длинна",55,"см"]]},{"rating":3,"name":"descueni el 5","type":"teapot","sort":"turrist","sortRu":"походные","typeRu":"Чайник","company":"Lenovo","value":"500","url":"1208_chaynik-pokhodnyy-alyuminievy.jpg","description":"Очень удобный чайник прекрасно подходящий для всех нужд и т.д,покупайте у нас по самой низкой цене бла бла бла","har":[["Вольтаж",120,"вольт"],["Ширина",30,"см"],["Высота",60,"см"],["Длинна",30,"см"],["Обьем",30,"литр"],["Встроенный аккумулятор",false]]}]
    shuffle(array)
    res.json(arr)
})

module.exports = router